Autodesk.Revit.DB.Architecture.PatternJustification
Justification of patterns distribution.
Since:
2019

Autodesk.Revit.DB.Architecture.PatternJustification.SpreadPatternToFit
Patters are distrubuted to not last excess length.

Autodesk.Revit.DB.Architecture.PatternJustification.Center
Patterns are distributed starting from the center of a railing path.

Autodesk.Revit.DB.Architecture.PatternJustification.End
Patterns are distributed starting from the ending of a railing path.

Autodesk.Revit.DB.Architecture.PatternJustification.Beginning
Patterns are distributed starting from the beginning of a railing path.